packages/archaea-simulation/archaea_simulation-1.1.3-py3-none-any.whl/archaea_simulation/cfd/case/Allrun
#!/bin/sh
cd ${0%/*} || exit 1    # run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

runApplication surfaceFeatures

runApplication blockMesh
runApplication snappyHexMesh -overwrite

runApplication $(getApplication)

simpleFoam -postProcess -func writeCellCentres
# simpleFoam -postProcess -func sample
simpleFoam -postProcess -func cutPlaneSurface

#------------------------------------------------------------------------------
